In [1]:
import numpy as np
import pandas as pd

In [1]:
def variance(nums):
    x_bar=sum(nums)/len(nums)
    temp=0
    for i in nums:
        distance=(i-x_bar)**2
        temp+=distance
    return temp/len(nums)

In [3]:
l=[-5,0,5,15,10]
variance(l)

50.0

In [9]:
l=np.array(l)
l.mean()

np.float64(5.0)

In [2]:
df=pd.read_csv('file.csv')

In [17]:
df.tail()

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [18]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [22]:
df['City']

0     Cairo
1      Alex
2     Aswan
3      Alex
4      Giza
5      Alex
6     Luxor
7     Aswan
8      Alex
9     Cairo
10     Giza
Name: City, dtype: object

In [24]:
df['Length'].mean()

np.float64(10.909090909090908)

In [25]:
df['Length'].median()

np.float64(8.0)

In [30]:
df['Length']

0     20
1     15
2     30
3     10
4      5
5     12
6      5
7      7
8      2
9      8
10     6
Name: Length, dtype: int64

In [34]:
print(df.head())
df.tail()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

    Length  Width   City    Price
6        5     30  Luxor   500000
7        7     20  Aswan   700000
8        2     40   Alex  9000000
9        8     20  Cairo   900000
10       6     14   Giza  6000000

In [35]:
df['Length'].std()

np.float64(8.141922935701928)

In [3]:
df['Length'].var()

np.float64(66.29090909090908)

In [11]:
Q1=df['Length'].quantile(.25)
Q2=df['Length'].median()
Q3=df['Length'].quantile(.75)

In [12]:
IQR=Q3-Q1

In [14]:
Q1

np.float64(5.5)

In [15]:
df['Length']

0     20
1     15
2     30
3     10
4      5
5     12
6      5
7      7
8      2
9      8
10     6
Name: Length, dtype: int64

In [17]:
df.sort_values('Length')['Length']

8      2
6      5
4      5
10     6
7      7
9      8
3     10
5     12
1     15
0     20
2     30
Name: Length, dtype: int64

In [24]:
df['Length'].sort_values()

8      2
6      5
4      5
10     6
7      7
9      8
3     10
5     12
1     15
0     20
2     30
Name: Length, dtype: int64

In [28]:
df.select_dtypes('number').corr()

          Length     Width     Price
Length  1.000000 -0.315013 -0.350141
Width  -0.315013  1.000000  0.721231
Price  -0.350141  0.721231  1.000000

In [29]:
df.head(2)

   Length  Width   City   Price
0      20     10  Cairo  500000
1      15     15   Alex  400000

In [30]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [31]:
df.dtypes

Length     int64
Width      int64
City      object
Price      int64
dtype: object

In [32]:
df['City']=df['City'].astype('category')

In [33]:
df.dtypes

Length       int64
Width        int64
City      category
Price        int64
dtype: object

In [34]:
df.head()

   Length  Width   City    Price
0      20     10  Cairo   500000
1      15     15   Alex   400000
2      30     20  Aswan  1500000
3      10     50   Alex  8000000
4       5     15   Giza   800000

In [35]:
sub_df=df[['Length','Width']]

In [40]:
sub_df[cols]=sub_df[cols].astype('float')

C:\Users\HP Zbook Fury 15 G7\AppData\Local\Temp\ipykernel_23724\1857277096.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sub_df[cols]=sub_df[cols].astype('float')

In [37]:
cols=['Length','Width']

In [38]:
sub2=df[cols]

In [42]:
sub_df.dtypes

Length    float64
Width     float64
dtype: object

In [44]:
df.describe()

          Length      Width         Price
count  11.000000  11.000000  1.100000e+01
mean   10.909091  22.181818  2.663636e+06
std     8.141923  12.781379  3.298567e+06
min     2.000000  10.000000  4.000000e+05
25%     5.500000  14.500000  6.000000e+05
50%     8.000000  20.000000  9.000000e+05
75%    13.500000  25.000000  3.750000e+06
max    30.000000  50.000000  9.000000e+06

In [45]:
df.describe(include='category')

        City
count     11
unique     5
top     Alex
freq       4

In [46]:
df['City']

0     Cairo
1      Alex
2     Aswan
3      Alex
4      Giza
5      Alex
6     Luxor
7     Aswan
8      Alex
9     Cairo
10     Giza
Name: City, dtype: category
Categories (5, object): ['Alex', 'Aswan', 'Cairo', 'Giza', 'Luxor']

In [52]:
s=df['City'].value_counts()

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Length  11 non-null     int64
 1   Width   11 non-null     int64
 2   City    11 non-null     category
 3   Price   11 non-null     int64
dtypes: category(1), int64(3)
memory usage: 619.0 bytes

In [58]:
df.max(numeric_only=True)

Length         30
Width          50
Price     9000000
dtype: int64